_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_1 (Embedding)      (None, 60, 500)           10000000  
_________________________________________________________________
lstm_1 (LSTM)                (None, 60, 500)           2002000   
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 500)           0         
_________________________________________________________________
time_distributed_1 (TimeDist (None, 60, 500)           250500    
_________________________________________________________________
conv1d_1 (Conv1D)            (None, 60, 32)            80032     
_________________________________________________________________
flatten_1 (Flatten)          (None, 1920)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 1921      
=================================================================
Total params: 12,334,453
Trainable params: 12,334,453
Non-trainable params: 0
_________________________________________________________________

