Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding (Embedding)        (None, 60, 500)           25000000  
_________________________________________________________________
lstm (LSTM)                  (None, 60, 500)           2002000   
_________________________________________________________________
dropout (Dropout)            (None, 60, 500)           0         
_________________________________________________________________
time_distributed (TimeDistri (None, 60, 500)           250500    
_________________________________________________________________
conv1d (Conv1D)              (None, 60, 32)            48032     
_________________________________________________________________
dense_1 (Dense)              (None, 60, 50)            1650      
_________________________________________________________________
flatten (Flatten)            (None, 3000)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 3001      
=================================================================
Total params: 27,305,183
Trainable params: 27,305,183
Non-trainable params: 0
_________________________________________________________________

